tutorials_13/STR_Kevin_inlet_hole/0/T.liquid
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      T.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions          [0 0 0 1 0 0 0];

internalField       uniform 337.15;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    "walls|propeller"
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    
    inlet
    {
        type            zeroGradient;
        value           $internalField;
    }
    

}

// ************************************************************************* //
