tutorials_13/STR_Kevin_inlet_hole/0/U.gas
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U.gas;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

#include "$FOAM_CASE/constant/globalVars"

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
/*        type            turbulentInlet;
        fluctuationScale (0 0.1 0);
        referenceField  uniform (0 $Uin 0);
        value           uniform (0 $Uin 0); */
        type                flowRateInletVelocity;
        volumetricFlowRate  0.0000416667; //2.5 LPM
        profile             turbulentBL;

    }
    outlet
    {
        type            pressureInletOutletVelocity;
        phi             phi.gas;
        value           $internalField;
    }
    walls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    
    propeller
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    
}

// ************************************************************************* //
