tutorials_13/STR_Kevin_inlet_hole/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions


runApplication setFields
runApplication decomposePar -force
runParallel foamRun 
