tutorials_13/STR_Kevin_inlet_hole/constant/heatTransfer
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      heatTransfer;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

blending        heatAndDiffusiveMassTransfer;


gas_dispersedIn_liquid_inThe_gas
{
    type spherical;
    residualAlpha 1e-4;
}

gas_dispersedIn_liquid_inThe_liquid
{
    type RanzMarshall;
    residualAlpha 1e-4;
}

liquid_dispersedIn_gas_inThe_gas
{
    type RanzMarshall;
    residualAlpha 1e-4;
}

liquid_dispersedIn_gas_inThe_liquid
{
    type spherical;
    residualAlpha 1e-4;
}

// ************************************************************************* //
