tutorials_13/STR_Kevin_inlet_hole/system/fvConstraints
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvConstraints;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

limitp
{
    type       limitPressure;

    min        1e4;
}
/*
limitT
{
    type            limitTemperature;

    select          all;

    field           T;   // Optional energy/temperature field name
                            // Set to T for compressibleVoF

    phase           gas; // Optional phase name

    min             283;
    max             303;
}

*/
// ************************************************************************* //
